# Packages documented in terminal-zsh-guide.md.

brew "atuin"
brew "bat"
brew "direnv"
brew "eza"
brew "fd"
brew "fzf"
brew "git-delta"
brew "lazygit"
brew "luarocks"
brew "neovim"
brew "ripgrep"
brew "shellcheck"
brew "shfmt"
brew "starship"
brew "stylua"
brew "tree-sitter"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"

cask "font-jetbrains-mono-nerd-font"
